import cl from "./style.module.css"

const Article2 = () => {
    return (
        <main className={cl.article}>
        <div className={cl.article__cover4}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Казань</h2>
                <p>Казань – столица Республики Татарстан, один из самых красивых и динамично развивающихся городов
                    России. Это место, где переплетаются татарская и русская культуры,а традиции гармонично сочетаются с
                    современностью.Казань — город, в котором чувствуется особый колорит: здесь звучит азан с минаретов и
                    перезвон церковных колоколов, пахнет эчпочмаками и горячими блинами, а на улицах слышна как
                    татарская,
                    так и русская речь.</p>
            </div>
        </div>
        <div className={cl.article__cover5}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Историческая архитектура Казани</h2>
                <p>Казань — один из старейших городов России, где переплетаются восточная и западная культура, исламские
                    и православные традиции. Архитектура города отражает его богатую историю, начиная с эпохи Волжской
                    Булгарии и Казанского ханства до времен Российской империи и современности.Русская архитектура
                    XVI–XVIII вв.
                    После взятия Казани Иваном Грозным город стал православным центром Поволжья.

                    Памятники:
                    Благовещенский собор – старейший православный храм Казани, построенный псковскими
                    мастерами в стиле древнерусского зодчества.

                    Петропавловский собор – яркий образец русского барокко, с роскошным фасадом и высокой
                    колокольней.

                    Дворцовая (Введенская) церковь в Кремле (XVIII в.) – домовый храм казанских губернаторов.
                    Казань — центр татарской культуры, где сохранились старинные мечети и медресе.

                    Главные памятники:
                    Мечеть Марджани – первая каменная мечеть, построенная после указа Екатерины II о
                    веротерпимости.

                    Азимовская мечеть (XIX в.) – образец татарской эклектики с минаретом в виде свечи.

                    Закабанная мечеть – редкий пример советской мечети в стиле модерн.
                </p>
            </div>
         </div>
         <div className={cl.article__cover6}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Современная архитектура Казани</h2>
                <p>Казань — динамично развивающийся город, где гармонично сочетаются историческое наследие и
                    ультрасовременные постройки. В последние десятилетия здесь появились впечатляющие объекты,
                    отражающие амбиции Татарстана как одного из самых прогрессивных регионов России.
                    Казань за последние 20 лет превратилась в один из самых динамичных городов России с точки
                    зрения современной архитектуры. Здесь гармонично сочетаются восточные мотивы, высокие
                    технологии и европейский урбанизм.
                    Основные тренды современной архитектуры Казани:Смешение стилей – постмодернизм, хай-тек, био-тек и неофутуризм.

                    Символичность – многие здания отражают татарскую культуру и историю.
                    Эксперименты с формами – здания-чаши, криволинейные фасады, стеклянные конструкции.
                    Функциональность – упор на общественные пространства, IT-кластеры, спортивные объекты.
                </p>
            </div>
        </div>
    </main>
    )
}

export default Article2