import cl from "./style.module.css"

const Article3 = () => {
    return (
        <main className={cl.article}>
        <div className={cl.article__cover7}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Сахалин</h2>
                <p>Сахалин – самый крупный остров России,где дикая природа раскрывается во всей своей первозданной
                    красоте. б. Это место
                    потрясающей природы, где горы встречаются с океаном, а уникальная флора и фауна создают ощущение
                    настоящего приключения.</p>
            </div>
        </div>
        <div className={cl.article__cover8}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Историческая архитектура Сахалина</h2>
                <p>Историческая архитектура Сахалина отражает сложную историю острова, на которую повлияли коренные
                    народы, русские, японские и советские традиции. Вот основные периоды и стили:
                    Советский период (с 1945 года) -
                    После возвращения Южного Сахалина в состав СССР архитектура стала более функциональной:

                    Сталинский ампир – здание областной администрации в Южно-Сахалинске.

                    Типовая советская застройка – панельные дома 1960–1980-х.

                    Промышленные сооружения – порты, шахтёрские посёлки (Углегорск, Шахтёрск).</p>
            </div>
        </div>
        <div className={cl.article__cover9}>
            <div className={cl.article__overlay}>
            </div>
            <div className={cl.article__content}>
                <h2>Современная архитектура Сахалина</h2>
                <p>Современная архитектура Сахалина сочетает в себе элементы функционального дизайна, климатической
                    адаптации и отсылки к историческому наследию острова. В последние десятилетия здесь появляются новые
                    общественные, жилые и инфраструктурные объекты, отражающие как общероссийские тренды, так и
                    региональную специфику.Стекло и бетон в деловых центрах:

                    Современные бизнес-центры и торговые комплексы (например, "Сити Молл", "Панорама").
                    
                    Новый аэропорт Южно-Сахалинска (реконструкция 2019 г.) – сочетание функциональности и эстетики.
                    Современные культурные объекты:

                    Сахалинский театр кукол (новое здание с необычным дизайном).
                    
                    Музейно-мемориальный комплекс "Победа" (современный музей с интерактивными экспозициями).</p>
            </div>
        </div>
    </main>
    )
}

export default Article3